# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Arquivos (Texto)}
#+latex: \mytitleslide

* Exemplo das diferenças com /float/

1 byte = 8 bits
- Texto: um caractere \to 10 dígitos diferentes
- Binário: Um byte \to 2^8 valores possíveis

#+latex: \vfill\pause

Vejamos um exemplo com um =float=:
#+begin_src C
#include <stdio.h>
float f;
f = -1298721.72672;
FILE *fp_binario = fopen("arquivo.bin", "w");
fwrite(&f, sizeof(float), 1, fp_binario);
fclose(fp_binario);

FILE *fp_texto = fopen("arquivo.txt", "w");
fprintf(fp_texto, "%f", f);
fclose(fp_texto);
#+end_src

#+RESULTS:

Tamanhos em bytes
#+begin_src shell :results output :exports results
wc -c arquivo.bin
wc -c arquivo.txt
#+end_src

#+RESULTS:
: 4 arquivo.bin
: 15 arquivo.txt

* Exemplo #2: Emprego do ~fgets~

*Objetivo*: ler de arquivo o valor de uma /string/
- A função ~fgets~ não permite usar formatação!
- Perceba como o ~fgets~ captura o terminador da linha ~\n~

#+BEGIN_SRC C :tangle e/a37-fputs.c :results output 
#include <stdio.h>
#define TAMANHO 30
int main() {
  char str[TAMANHO] = {0};
  FILE *arq;
  arq = fopen("meu_arquivo_texto.txt", "r");
  if (arq == NULL) {
    printf("Problema ao abrir o arquivo para escrita. Fatal.\n");
    return 0;
  }
  fgets(str, TAMANHO, arq);
  printf("[%s]\n", str);
  fclose(arq);
  return 0;
}
#+END_SRC

#+RESULTS:
: [490
: ]
* Exemplo ``Avançado'' #2: Ler arquivo ~CSV~

Programa que lê um CSV com registros com nome, idade e altura.

#+BEGIN_SRC C :tangle e/a37-atleta-texto-leitura.c :results output 
#include <stdio.h>
#define TAMANHO 32
int main() {
  char nome[TAMANHO];
  int idade;
  int altura;
  FILE *arq = fopen("registros.csv", "r");
  if (arq == NULL) {
    printf("Problema ao abrir o arquivo para leitura. Fatal.\n");
    return 0;
  }
  // Le o cabeçalho
  fgets(nome, TAMANHO, arq);
  while(feof(arq) == 0){
    int lidos = fscanf(arq, "%s,%d,%d", nome, &idade, &altura);
    printf("Dados %d lidos: [%s] [%d] [%d]\n", lidos, nome, idade, altura);
  }
  fclose(arq);
  return 0;
}
#+END_SRC

#+RESULTS:
: Dados 1 lidos: [Solar,32,155] [21977] [-1872207195]
: Dados 1 lidos: [Alpha,45,162] [21977] [-1872207195]
: Dados 1 lidos: [Centauri,43,175] [21977] [-1872207195]
: Dados -1 lidos: [Centauri,43,175] [21977] [-1872207195]
